auto_run/auto_run_twoP/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -2.5 -0.5 -0.5)
    ( 2.5 -0.5 -0.5)
    ( 2.5 0.5 -0.5)
    ( -2.5 0.5 -0.5)
    ( -2.5 -0.5  0.5)
    ( 2.5 -0.5  0.5)
    ( 2.5 0.5  0.5)
    ( -2.5 0.5  0.5)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (nc_L nc_H 1) simpleGrading (  ((2 100 0.05) (1 nc_H 1) (2 100 20)) 1 1)
);

edges
(
);

boundary
(
    left  { type patch; faces ( (0 4 7 3)); }
    right { type patch; faces ( (2 6 5 1)); }
    bottom{ type wall; faces ( (1 5 4 0)); }
    top   { type wall; faces ( (3 7 6 2)); }
    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
